Repository: Djamilakbarov/mafia_meeting
Catalog: lib/l10n/app_*.arb
Languages: az

source: Day 1
az: 1-ci Gün

source: Welcome
az: Xoş gəlmisiniz

source: Phase
az: Faza

# phaseDiscussion
source: Discussion
az: Müzakirə

# phaseVoting
source: Voting
az: Səsvermə

# phaseResult
source: Results
az: Nəticələr

# results
source: Results and summary
az: Oyun nəticələri

# resultsPhaseInfo
source: Game is over. Reviewing the outcome...
az: Oyun bitdi. Nəticələr yekunlaşdırılır...

source: Choose player to accuse:
az: İtham etmək üçün oyunçu seçin:

source: Player
az: Oyunçu

source: Skip discussion
az: Müzakirəni atla

source: Accused
az: İtham olunan

source: Your verdict:
az: Sizin qərarınız:

# voteKill
source: Execute
az: Edam et

# voteSpare
source: Spare
az: Bağışla

# votedToKill
source: You voted to execute
az: Siz edam etməyə səs verdiniz

# votedToSpare
source: You voted to spare
az: Siz bağışlamağa səs verdiniz

source: Discussion skipped
az: Müzakirə atlandı

# voteResults
source: Voting Results
az: Səsvermə nəticələri

source: Next Day
az: Növbəti gün

source: Lobby
az: Lobi

source: Create Room
az: Otaq yarat

# joinRoom
source: Join
az: Qoşul

source: Room Code
az: Otaq kodu

source: Players
az: Oyunçular

source: Start Game
az: Oyuna başla

source: Invalid room code
az: Yanlış otaq kodu

source: Error
az: Xəta

source: Leave
az: Çıx

source: Dark Theme
az: Qaranlıq tema

source: Language
az: Dil

# langRu
source: Russian
az: Rus

# langEn
source: English
az: İngilis

# langAz
source: Azerbaijani
az: Azərbaycan

source: Settings
az: Parametrlər

source: Admin Panel
az: Admin paneli

source: My Profile
az: Profilim

source: Game History
az: Oyun tarixçəsi

source: Eliminated
az: Öldürülüb

source: Best Player
az: Ən yaxşı oyunçu

source: Likes
az: Bəyənmələr

source: Wins
az: Qələbələr

source: Losses
az: Məğlubiyyətlər

source: Rating
az: Reytinq

# noHistoryData
source: No data available
az: Məlumat yoxdur

# gameResultWin
source: 🏆 Win
az: 🏆 Qələbə

# gameResultLoss
source: 💀 Loss
az: 💀 Məğlubiyyət

source: Your Role
az: Sizin rolunuz

# enterNameAndCode
source: Enter room code and your name
az: Otaq kodunu və adınızı daxil edin

# enterName
source: Enter your name
az: Adınızı daxil edin

# nightTime
source: Night
az: Gecə

# discussionTime
source: Discussion
az: Müzakirə

# votingTime
source: Voting
az: Səsvermə

# seconds
source: sec
az: san

source: Create and Join
az: Yarat və qoşul

# roomPlayers
source: Players in room
az: Otaqdakı oyunçular

# notEnoughPlayers
source: Not enough players (min 4)
az: Kifayət qədər oyunçu yoxdur (minimum 4)

source: 🩸 Mafia Wins!
az: 🩸 Mafiya qalib gəldi!

source: 🛡 Villagers Win!
az: 🛡 Kəndlilər qalib gəldi!

# mafiaEliminatedAllThreats
source: The mafia eliminated all threats.
az: Mafiya bütün təhlükələri aradan qaldırdı.

# villagersDefeatedMafia
source: The villagers defeated the mafia.
az: Kəndlilər mafiyanı məğlub etdi.

source: Play Again
az: Yenidən oyna

# ad
source: Advertisement
az: Reklam

# continueButton
source: Continue
az: Davam et

source: Unknown
az: Naməlum

source: N/A
az: M/C

source: Room
az: Otaq

source: Static Rooms
az: Sabit otaqlar

source: Phase Times
az: Faza vaxtları

# cameraLoading
source: Loading camera...
az: Kamera yüklənir...

# cameraError
source: Camera error: no access.
az: Kamera xətası: giriş yoxdur.

source: You
az: Siz

source: Message
az: Mesaj

source: Role
az: Rol

# alreadyInRoom
source: You are already in this room. Please enter a different name.
az: Siz artıq bu otaqdasınız. Fərqli bir ad daxil edin.

source: Room does not exist
az: Otaq mövcud deyil

# messageBlocked
source: Your message contains prohibited words and was blocked.
az: Mesajınız qadağan olunmuş sözlər ehtiva edir və bloklanıb.

# adminCheckError
source: Error checking admin status. Please try again.
az: Admin statusu yoxlanılarkən xəta baş verdi. Yenidən cəhd edin.

source: Checking admin status...
az: Admin statusu yoxlanılır...

source: Admin Access
az: Admin girişi

# noAdminAccess
source: You do not have admin access to this panel.
az: Bu panel üçün admin hüququnuz yoxdur.

# addAds
source: Add Advertisement
az: Reklam əlavə et

# bannerUrl
source: Banner URL (image or gif):
az: Banner URL (şəkil və ya gif):

# linkOptional
source: Link on click (optional):
az: Klik üçün link (istəyə bağlı):

source: Active?
az: Aktiv?

source: Save Banner
az: Banneri saxla

# bannerUrlEmpty
source: Banner URL cannot be empty.
az: Banner URL boş ola bilməz.

# bannerAddedSuccess
source: ✅ Banner added successfully
az: ✅ Banner uğurla əlavə edildi

# bannerAddError
source: Error adding banner
az: Banner əlavə edilərkən xəta baş verdi

# promoText
source: 🎯 AD: Participate in the Mafia Challenge tournament and win prizes!
az: 🎯 REKLAM: Mafia Challenge turnirində iştirak edin və mükafatlar qazanın!

source: 📜 View Admin Logs
az: 📜 Admin jurnalları

source: 📋 Users
az: 📋 İstifadəçilər

source: Games
az: Oyunlar

# usersLoadError
source: Error loading users
az: İstifadəçilər yüklənərkən xəta baş verdi

# createRoomError
source: Error creating room
az: Otaq yaradılarkən xəta baş verdi

# joinRoomError
source: Error joining room
az: Otağa qoşularkən xəta baş verdi

# createStaticRoomError
source: Error creating static room
az: Sabit otaq yaradılarkən xəta baş verdi

# addPlayerError
source: Error adding player to room
az: Oyunçu otağa əlavə edilərkən xəta baş verdi

source: Profile
az: Profil

source: Likes Received
az: Alınan bəyənmələr

# bestPlayerTitle
source: Best Player Count
az: Ən yaxşı oyunçu (dəfə)

source: Profile not found
az: Profil tapılmadı

# profileLoadError
source: Error loading profile
az: Profil yüklənərkən xəta baş verdi

source: 🏆 Win
az: 🏆 Qələbə

source: 💀 Loss
az: 💀 Məğlubiyyət

# loadRoomSettingsError
source: Error loading room settings
az: Otaq parametrləri yüklənərkən xəta baş verdi

# peerInfoSaveError
source: Error saving peer info
az: Peer məlumatı saxlanılarkən xəta baş verdi

# videoPeersError
source: Video peers stream error
az: Video axını xətası

# startGameError
source: Error starting game
az: Oyun başladılarkən xəta baş verdi

# leaveRoomError
source: Error leaving room
az: Otaqdan çıxarkən xəta baş verdi

# alreadyLiked
source: You have already liked a player.
az: Siz artıq bu oyunçunu bəyənmisiniz.

# likedPlayer
source: You liked {playerName}!
az: Siz {playerName} bəyəndiniz!

# cannotLikeSelf
source: You cannot like yourself.
az: Özünüzü bəyənə bilməzsiniz.

source: Role Distribution
az: Rolların paylanması

source: Vote
az: Səsvermə

# castVote
source: Cast your vote
az: Səs ver

# nightPhaseInfo
source: Night phase in progress...
az: Gecə fasiləsi davam edir...

# morningPhaseInfo
source: Morning phase begins...
az: Səhər fasiləsi başlayır...

source: 🔪 Maniac Wins!
az: 🔪 Dəli qalib gəldi!

source: Player eliminated
az: Oyunçu öldürüldü

# noOneEliminated
source: No one was eliminated this round.
az: Bu raundda heç kim öldürülmədi.

source: All votes:
az: Bütün səslər:

# votedFor
source: You voted for
az: Siz səs verdiniz

# actionSubmitted
source: Action submitted for
az: Gecə hərəkəti təsdiq edildi

source: Chat error
az: Söhbət xətası

source: Like
az: Bəyən

# chooseTarget
source: Choose your target for the night action:
az: Gecə hərəkəti üçün hədəf seçin:

# mafiaAction
source: Kill
az: Öldür

# mafiaActionHint
source: Choose who to kill tonight.
az: Bu gecə kimin öldürüləcəyini seçin.

# doctorAction
source: Heal
az: Müalicə et

# doctorActionHint
source: Choose who to heal tonight.
az: Bu gecə kimin müalicə ediləcəyini seçin.

# detectiveAction
source: Check
az: Yoxla

# detectiveActionHint
source: Choose who to investigate tonight.
az: Bu gecə kimin yoxlanılacağını seçin.

# maniacAction
source: Maniac Kill
az: Dəli qətli

# maniacActionHint
source: Choose who to kill as Maniac.
az: Dəli kimi kimin öldürüləcəyini seçin.

# lastNightVictim
source: Last night's victim
az: Keçən gecənin qurbanı

# noVictim
source: No victim last night.
az: Keçən gecə heç bir qurban yoxdur.

source: Processing Results...
az: Nəticələr emal edilir...

source: Game Over!
az: Oyun bitdi!

# roomClosed
source: Room closed by host or no longer exists.
az: Otaq host tərəfindən bağlanıb və ya artıq mövcud deyil.

source: Room error
az: Otaq xətası

source: Time Left
az: Qalan vaxt

# mafiaRole
source: Mafia
az: Mafiya

# doctorRole
source: Doctor
az: Həkim

# detectiveRole
source: Detective
az: Detektiv

# maniacRole
source: Maniac
az: Dəli

# villagerRole
source: Villager
az: Kəndli

source: Select Image Source
az: Şəkil mənbəyini seçin

source: Camera
az: Kamera

source: Gallery
az: Qalereya

source: Change Avatar
az: Avatarı dəyiş

source: Delete Avatar
az: Avatarı sil

# avatarUploadSuccess
source: Avatar uploaded successfully!
az: Avatar uğurla yükləndi!

# avatarUploadError
source: Failed to upload avatar
az: Avatar yüklənərkən xəta baş verdi

# avatarDeleteSuccess
source: Avatar deleted successfully!
az: Avatar uğurla silindi!

# avatarDeleteError
source: Failed to delete avatar
az: Avatar silinərkən xəta baş verdi

source: Country
az: Ölkə

# roomCodeIs
source: Your room code is:
az: Otaq kodunuz:

# videoCallTitle
source: Video Call
az: Video Zəng

source: Setup Username
az: İstifadəçi Adı Təyin Et

# welcomePleaseEnterUsername
source: Welcome! Please enter your desired username to start.
az: Xoş gəlmisiniz! Başlamaq üçün istədiyiniz istifadəçi adını daxil edin.

source: Username
az: İstifadəçi Adı

source: Save and Continue
az: Yadda Saxla və Davam Et

source: Username cannot be empty.
az: İstifadəçi adı boş ola bilməz.

# usernameLengthError
source: Username must be between 3 and 20 characters.
az: İstifadəçi adı 3 ilə 20 simvol arasında olmalıdır.

# usernameAlreadyTaken
source: This username is already taken. Please choose another.
az: Bu istifadəçi adı artıq istifadə olunur. Zəhmət olmasa başqa seçin.

# saveUsernameError
source: Error saving username
az: İstifadəçi adını yadda saxlama xətası

source: Mute
az: Səsi kəs

source: Unmute
az: Səsi aç

source: Hide Video
az: Videonu gizlət

source: Show Video
az: Videonu göstər

# selectLanguageForRoom
source: Select language for the room
az: Otaq üçün dil seçin

source: Room language
az: Otaq dili

source: Active rooms
az: Aktiv otaqlar

source: No active rooms
az: Aktiv otaq yoxdur

# statusWaitingForPlayers
source: Waiting for players
az: Oyunçular gözlənilir

# statusGameStarted
source: Game started
az: Oyun başladı

# statusInProgress
source: Game in progress
az: Oyun davam edir

# statusGameOver
source: Game over
az: Oyun bitdi

# statusUnknown
source: Unknown status
az: Naməlum status

source: Join
az: Qoşul

source: Host
az: Host (Yaradan)

# usernameChangeLimit
source: Username can only be changed once every 24 hours.
az: İstifadəçi adı yalnız 24 saatda bir dəfə dəyişdirilə bilər.

# usernameSaved
source: Username saved successfully!
az: İstifadəçi adı uğurla yadda saxlanıldı!

source: Personal Settings
az: Şəxsi Parametrlər

# viewEditProfile
source: View and edit your profile
az: Profilinizə baxın və redaktə edin

source: Change Username
az: İstifadəçi Adını Dəyiş

source: Save
az: Yadda Saxla

source: App Settings
az: Tətbiq Parametrləri

source: Dark Mode
az: Qaranlıq Rejim

# supportProject
source: Support the Project 💖
az: Layihəni Dəstəkləyin 💖

# supportProjectDescription
source: Help us improve the app with your donations.
az: Tətbiqi inkişaf etdirməyimizə kömək edin.

# noGameHistory
source: No game history found.
az: Oyun tarixçəsi tapılmadı.

source: None
az: Yoxdur

source: Unknown Player
az: Naməlum Oyunçu

source: Result
az: Nəticə

# adminAccessDescription
source: Access administrative tools and logs.
az: İnzibati alətlərə və loqlara giriş.

# errorLoadingHistory
source: Error loading game history
az: Oyun tarixçəsi yüklənərkən xəta baş verdi
